GopalSaraf/Practicals/PSDL/include/proc/pic12f510.h
extern volatile ADCON0bits_t ADCON0bits __at(0x008);
// bitfield macros
#define _ADCON0_ADON_POSN                                   0x0
#define _ADCON0_ADON_POSITION                               0x0
#define _ADCON0_ADON_SIZE                                   0x1
#define _ADCON0_ADON_LENGTH                                 0x1
#define _ADCON0_ADON_MASK                                   0x1
#define _ADCON0_GO_nDONE_POSN                               0x1
#define _ADCON0_GO_nDONE_POSITION                           0x1
#define _ADCON0_GO_nDONE_SIZE                               0x1
#define _ADCON0_GO_nDONE_LENGTH                             0x1
#define _ADCON0_GO_nDONE_MASK                               0x2
#define _ADCON0_CHS_POSN                                    0x2
#define _ADCON0_CHS_POSITION                                0x2
#define _ADCON0_CHS_SIZE                                    0x2
#define _ADCON0_CHS_LENGTH                                  0x2
#define _ADCON0_CHS_MASK                                    0xC
#define _ADCON0_ADCS_POSN                                   0x4
#define _ADCON0_ADCS_POSITION                               0x4
#define _ADCON0_ADCS_SIZE                                   0x2
#define _ADCON0_ADCS_LENGTH                                 0x2
#define _ADCON0_ADCS_MASK                                   0x30
#define _ADCON0_ANS_POSN                                    0x6
#define _ADCON0_ANS_POSITION                                0x6
#define _ADCON0_ANS_SIZE                                    0x2
#define _ADCON0_ANS_LENGTH                                  0x2
#define _ADCON0_ANS_MASK                                    0xC0
#define _ADCON0_GO_POSN                                     0x1
#define _ADCON0_GO_POSITION                                 0x1
#define _ADCON0_GO_SIZE                                     0x1
#define _ADCON0_GO_LENGTH                                   0x1
#define _ADCON0_GO_MASK                                     0x2
#define _ADCON0_CHS0_POSN                                   0x2
#define _ADCON0_CHS0_POSITION                               0x2
#define _ADCON0_CHS0_SIZE                                   0x1
#define _ADCON0_CHS0_LENGTH                                 0x1
#define _ADCON0_CHS0_MASK                                   0x4
#define _ADCON0_CHS1_POSN                                   0x3
#define _ADCON0_CHS1_POSITION                               0x3
#define _ADCON0_CHS1_SIZE                                   0x1
#define _ADCON0_CHS1_LENGTH                                 0x1
#define _ADCON0_CHS1_MASK                                   0x8
#define _ADCON0_ADCS0_POSN                                  0x4
#define _ADCON0_ADCS0_POSITION                              0x4
#define _ADCON0_ADCS0_SIZE                                  0x1
#define _ADCON0_ADCS0_LENGTH                                0x1
#define _ADCON0_ADCS0_MASK                                  0x10
#define _ADCON0_ADCS1_POSN                                  0x5
#define _ADCON0_ADCS1_POSITION                              0x5
#define _ADCON0_ADCS1_SIZE                                  0x1
#define _ADCON0_ADCS1_LENGTH                                0x1
#define _ADCON0_ADCS1_MASK                                  0x20
#define _ADCON0_ANS0_POSN                                   0x6
#define _ADCON0_ANS0_POSITION                               0x6
#define _ADCON0_ANS0_SIZE                                   0x1
#define _ADCON0_ANS0_LENGTH                                 0x1
#define _ADCON0_ANS0_MASK                                   0x40
#define _ADCON0_ANS1_POSN                                   0x7
#define _ADCON0_ANS1_POSITION                               0x7
#define _ADCON0_ANS1_SIZE                                   0x1
#define _ADCON0_ANS1_LENGTH                                 0x1
#define _ADCON0_ANS1_MASK                                   0x80
#define _ADCON0_nDONE_POSN                                  0x1
#define _ADCON0_nDONE_POSITION                              0x1
#define _ADCON0_nDONE_SIZE                                  0x1
#define _ADCON0_nDONE_LENGTH                                0x1
#define _ADCON0_nDONE_MASK                                  0x2

// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x009);
#ifndef _LIB_BUILD
asm("ADRES equ 09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x009);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF

// Register: OPTION
#define OPTION OPTION
extern volatile __control unsigned char OPTION              __at(0x000);

// Register: TRIS
#define TRIS TRIS
extern volatile __control unsigned char TRIS                __at(0x006);

// Register: TRISGPIO
#define TRISGPIO TRISGPIO
extern volatile __control unsigned char TRISGPIO            __at(0x006);

/*
 * OPTION bits
 */
#define                                 PS                  0x7
#define                                 PSA                 0x8
#define                                 T0SE                0x10
#define                                 T0CS                0x20
#define                                 nGPPU               0x40
#define                                 nGPWU               0x80
#define                                 PS0                 0x1
#define                                 PS1                 0x2
#define                                 PS2                 0x4

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&01Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&01FFh)
#endif
// ADCON0<ADCS0>
extern volatile __bit                   ADCS0               __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON0,4)
// ADCON0<ADCS1>
extern volatile __bit                   ADCS1               __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON0,5)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON0<ANS0>
extern volatile __bit                   ANS0                __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 ANS0_bit            _BIT_ACCESS(ADCON0,6)
// ADCON0<ANS1>
extern volatile __bit                   ANS1                __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 ANS1_bit            _BIT_ACCESS(ADCON0,7)
// CM1CON0<C1NREF>
extern volatile __bit                   C1NREF              __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 C1NREF_bit          _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,3)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1PREF>
extern volatile __bit                   C1PREF              __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 C1PREF_bit          _BIT_ACCESS(CM1CON0,1)
// OSCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 CAL0_bit            _BIT_ACCESS(OSCCAL,1)
// OSCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 CAL1_bit            _BIT_ACCESS(OSCCAL,2)
// OSCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 CAL2_bit            _BIT_ACCESS(OSCCAL,3)
// OSCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 CAL3_bit            _BIT_ACCESS(OSCCAL,4)
// OSCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 CAL4_bit            _BIT_ACCESS(OSCCAL,5)
// OSCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 CAL5_bit            _BIT_ACCESS(OSCCAL,6)
// OSCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 CAL6_bit            _BIT_ACCESS(OSCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// STATUS<CWUF>
extern volatile __bit                   CWUF                __at(0x1E);	// @ (0x3 * 8 + 6)
#define                                 CWUF_bit            _BIT_ACCESS(STATUS,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// GPIO<GP0>
extern volatile __bit                   GP0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 GP0_bit             _BIT_ACCESS(GPIO,0)
// GPIO<GP1>
extern volatile __bit                   GP1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 GP1_bit             _BIT_ACCESS(GPIO,1)
// GPIO<GP2>
extern volatile __bit                   GP2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 GP2_bit             _BIT_ACCESS(GPIO,2)
// GPIO<GP3>
extern volatile __bit                   GP3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 GP3_bit             _BIT_ACCESS(GPIO,3)
// GPIO<GP4>
extern volatile __bit                   GP4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 GP4_bit             _BIT_ACCESS(GPIO,4)
// GPIO<GP5>
extern volatile __bit                   GP5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 GP5_bit             _BIT_ACCESS(GPIO,5)
// STATUS<GPWUF>
extern volatile __bit                   GPWUF               __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 GPWUF_bit           _BIT_ACCESS(STATUS,7)
// STATUS<PA0>
extern volatile __bit                   PA0                 __at(0x1D);	// @ (0x3 * 8 + 5)
#define                                 PA0_bit             _BIT_ACCESS(STATUS,5)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// CM1CON0<nC1OUTEN>
extern volatile __bit                   nC1OUTEN            __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 nC1OUTEN_bit        _BIT_ACCESS(CM1CON0,6)
// CM1CON0<nC1T0CS>
extern volatile __bit                   nC1T0CS             __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 nC1T0CS_bit         _BIT_ACCESS(CM1CON0,4)
// CM1CON0<nC1WU>
extern volatile __bit                   nC1WU               __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 nC1WU_bit           _BIT_ACCESS(CM1CON0,0)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)

#endif // _PIC12F510_H_
